// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = 0;
//
// if (a !== 0) {
//     console.log('Вірно');
// } else {
//     console.log(' HE Вірно');
// }


// - Дано змінну time яка рівна числу від 0 до 59.
// Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = 50;
// if (time === 0 || time <= 15) {
//     console.log('Перша четверть');
// } else if (time === 16 || time <= 30) {
//     console.log('Друга четверть');
// } else if (time === 31 || time <= 45) {
//     console.log('Третя четверть');
// } else if (time === 46 || time <= 69) {
//     console.log('Четверта четверть');
// }

// - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = 27;
//
// if (day === 1 || day <= 10) {
//     console.log('Перша декада');
// } else if (day === 11 || day <=20) {
//     console.log('Друга декада');
// } else if (day === 21 || day <=31) {
//     console.log('Третя декада');
// }


// - Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).
//
// let day = 7;
//
// switch (day){
//     case 1:
//         console.log('monday');
//         break;
//     case 2:
//         console.log('Tuesday');
//         break;
//     case 3:
//         console.log('Wednesday');
//         break;
//     case 4:
//         console.log('Thursday');
//         break;
//     case 5:
//         console.log('Friday');
//         break;
//     case 6:
//         console.log('Saturday');
//         break;
//     case 7:
//         console.log('Sunday');
//         break;
// }


//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

// let a = 10;
// let b = 10;
//
//     if(a > b) {
//         console.log(a);
//     }  else if (b > a) {
//         console.log(b);
//     }  if (a = b) {
//     console.log('a та b рівні');
// }

//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
//     Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"
//         якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let x = prompt('enter X') || 'default';
console.log(x);